# Кортеж анықтау
my_tuple = (1, 3, 5, 3, 7, 3, 9, "alma", "alma", "арбуз")

# Санды элементті санау
count_3 = my_tuple.count(3)
print(f"3 саны кортежде {count_3} рет кездеседі")  # Шығады: 3 саны кортежде 3 рет кездеседі

# Жолды (string) элементті санау
count_alma = my_tuple.count("alma")
print(f"'alma' сөзі кортежде {count_alma} рет кездеседі")  # Шығады: 'alma' сөзі кортежде 2 рет кездеседі

# Кездемейтін элементті санау
count_10 = my_tuple.count(10)
print(f"10 саны кортежде {count_10} рет кездеседі")  # Шығады: 10 саны кортежде 0 рет кездеседі


# Кортеж анықтау
fruits = ("алма", "алмұрт", "шабдалы", "банан", "алмұрт", "қарбыз")

# Элементтің индексін табу
index_banana = fruits.index("банан")
print(f"'банан' индексі: {index_banana}")  # Шығады: 'банан' индексі: 3

index_pear = fruits.index("алмұрт")
print(f"'алмұрт' бірінші рет кездесетін индексі: {index_pear}")  # Шығады: 'алмұрт' бірінші рет кездесетін индексі: 1